Autodesk.Revit.DB.Architecture.RailIndex
The continuous rail position index.
Since:
2013

Autodesk.Revit.DB.Architecture.RailIndex.RightSecondary
The rail is a secondary rail on the right.

Autodesk.Revit.DB.Architecture.RailIndex.LeftSecondary
The rail is a secondary rail on the left.

Autodesk.Revit.DB.Architecture.RailIndex.RightPrimary
The rail is a primary rail on the right.

Autodesk.Revit.DB.Architecture.RailIndex.LeftPrimary
The rail is a primary rail on the left.

Autodesk.Revit.DB.Architecture.RailIndex.Top
The rail is located on the top of the railing.